&НаСервере
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Проверка на пересечение времени бронирования для выбранного компьютера
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаБронь.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаявкаНаБронь КАК ЗаявкаНаБронь
		|ГДЕ
		|	ЗаявкаНаБронь.Проведен = ИСТИНА
		|	И ЗаявкаНаБронь.Компьютер = &Компьютер
		|	И ЗаявкаНаБронь.Ссылка <> &ТекущийДокумент
		|	И ЗаявкаНаБронь.НачалоСеанса < &ОкончаниеСеанса
		|	И ЗаявкаНаБронь.ОкончаниеСеанса > &НачалоСеанса";
	
	Запрос.УстановитьПараметр("Компьютер", Компьютер);
	Запрос.УстановитьПараметр("НачалоСеанса", НачалоСеанса);
	Запрос.УстановитьПараметр("ОкончаниеСеанса", ОкончаниеСеанса);
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		Сообщить("Выбранный компьютер (" + Строка(Компьютер) + ") уже забронирован на указанное время!");
	КонецЕсли;

КонецПроцедуры
