Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Для Каждого СтрокаТЧ Из Компьютеры Цикл
		Если СтрокаТЧ.Компьютер.Состояние = Перечисления.СостоянияКомпьютеров.Списан Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Компьютер """ + Строка(СтрокаТЧ.Компьютер) + """ уже списан!";
			Сообщение.Поле = "Компьютеры[" + (СтрокаТЧ.НомерСтроки - 1) + "].Компьютер";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Для Каждого СтрокаТЧ Из Компьютеры Цикл
		Движение = Движения.ИсторияСтатусовПК.Добавить();
		Движение.Период = Дата;
		Движение.Компьютер = СтрокаТЧ.Компьютер;
		Движение.Статус = Перечисления.СтатусыКомпьютеров.Списан;
		
		КомпОбъект = СтрокаТЧ.Компьютер.ПолучитьОбъект();
		КомпОбъект.Состояние = Перечисления.СостоянияКомпьютеров.Списан;
		КомпОбъект.Записать();
	КонецЦикла;
КонецПроцедуры