Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Для Каждого СтрокаТЧ Из Компьютеры Цикл
		Если СтрокаТЧ.Компьютер.Состояние = Перечисления.СостоянияКомпьютеров.Работает Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Компьютер """ + Строка(СтрокаТЧ.Компьютер) + """ уже числится работающим!";
			Сообщение.Поле = "Компьютеры[" + (СтрокаТЧ.НомерСтроки - 1) + "].Компьютер";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Для Каждого СтрокаТЧ Из Компьютеры Цикл
		Движение = Движения.ИсторияСтатусовПК.Добавить();
		Движение.Период = Дата;
		Движение.Компьютер = СтрокаТЧ.Компьютер;
		Движение.Статус = Перечисления.СтатусыКомпьютеров.Свободен;
		
		ДвижениеБух = Движения.Проводки.Добавить();
		ДвижениеБух.Период = Дата;
		ДвижениеБух.СчетДт = ПланыСчетов.Управленческий.Касса; // Временно касса (расход)
		ДвижениеБух.СчетКт = ПланыСчетов.Управленческий.Касса;
		ДвижениеБух.Сумма = -СтрокаТЧ.Стоимость; // Отрицательная сумма в кассе = расход
		
		// Обновляем стоимость закупки в справочнике
		КомпОбъект = СтрокаТЧ.Компьютер.ПолучитьОбъект();
		КомпОбъект.СтоимостьЗакупки = СтрокаТЧ.Стоимость;
		КомпОбъект.Состояние = Перечисления.СостоянияКомпьютеров.Работает;
		КомпОбъект.Записать();
	КонецЦикла;
КонецПроцедуры